DVE-FCT/stm32f405-omni-chassis/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define M1_DIR1_Pin GPIO_PIN_0
#define M1_DIR1_GPIO_Port GPIOC
#define M1_DIR2_Pin GPIO_PIN_1
#define M1_DIR2_GPIO_Port GPIOC
#define M2_DIR1_Pin GPIO_PIN_2
#define M2_DIR1_GPIO_Port GPIOC
#define M2_DIR2_Pin GPIO_PIN_3
#define M2_DIR2_GPIO_Port GPIOC
#define M3_DIR1_Pin GPIO_PIN_4
#define M3_DIR1_GPIO_Port GPIOC
#define M3_DIR2_Pin GPIO_PIN_5
#define M3_DIR2_GPIO_Port GPIOC
#define M4_DIR1_Pin GPIO_PIN_0
#define M4_DIR1_GPIO_Port GPIOB
#define M4_DIR2_Pin GPIO_PIN_1
#define M4_DIR2_GPIO_Port GPIOB
#define PS2_DI_Pin GPIO_PIN_12
#define PS2_DI_GPIO_Port GPIOB
#define PS2_DO_Pin GPIO_PIN_13
#define PS2_DO_GPIO_Port GPIOB
#define PS2_CS_Pin GPIO_PIN_8
#define PS2_CS_GPIO_Port GPIOB
#define PS2_CLK_Pin GPIO_PIN_9
#define PS2_CLK_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
